In [1]:
import numpy as np
import pandas as pd

In [4]:
a=pd.DataFrame(np.random.randn(4,4),index=list('ABCD'),columns=list('ABCD'))

In [5]:
print(a)

          A         B         C         D
A  0.193255 -1.604370  0.066718 -0.186390
B  0.758899 -1.351754 -1.366771 -1.229641
C -0.648357 -1.683695  1.635916 -0.980535
D  0.213892  0.991963  1.524901 -0.075859

In [15]:
b={'name':['Jony J','Eminem','KeyNG'],'gender':['男','男','男']}

In [16]:
print(pd.DataFrame(b))

     name gender
0  Jony J      男
1  Eminem      男
2   KeyNG      男

In [18]:
pd.DataFrame(b).dtypes

name      object
gender    object
dtype: object

In [19]:
c=pd.DataFrame(b)

In [20]:
c.head(1)

     name gender
0  Jony J      男

In [21]:
c.tail(2)

     name gender
1  Eminem      男
2   KeyNG      男

In [22]:
c.index

RangeIndex(start=0, stop=3, step=1)

In [23]:
c.columns

Index(['name', 'gender'], dtype='object')

In [24]:
c.values

array([['Jony J', '男'],
       ['Eminem', '男'],
       ['KeyNG', '男']], dtype=object)

In [25]:
c['name'].values

array(['Jony J', 'Eminem', 'KeyNG'], dtype=object)

In [26]:
c.loc[1]

name      Eminem
gender         男
Name: 1, dtype: object

In [29]:
c.iloc[0]

name      Jony J
gender         男
Name: 0, dtype: object

In [30]:
c['name']

0    Jony J
1    Eminem
2     KeyNG
Name: name, dtype: object

In [31]:
c.shape

(3, 2)

In [32]:
c.shape[0]

3

In [33]:
c.T

             0       1      2
name    Jony J  Eminem  KeyNG
gender       男       男      男

In [34]:
c.describe()

          name gender
count        3      3
unique       3      1
top     Jony J      男
freq         1      3

In [36]:
c.sum

<bound method DataFrame.sum of      name gender
0  Jony J      男
1  Eminem      男
2   KeyNG      男>

In [37]:
c.sum(1)

0    Jony J男
1    Eminem男
2     KeyNG男
dtype: object

In [42]:
d=pd.DataFrame([[1,2,3,4],[2,3,4,5],[3,4,5,6],[4,5,6,7]],index=list('ABCD'),columns=list('ABCD'))

In [43]:
print(d)

   A  B  C  D
A  1  2  3  4
B  2  3  4  5
C  3  4  5  6
D  4  5  6  7

In [48]:
d.apply(lambda x:x*2)

   A   B   C   D
A  2   4   6   8
B  4   6   8  10
C  6   8  10  12
D  8  10  12  14

In [49]:
d*2

   A   B   C   D
A  2   4   6   8
B  4   6   8  10
C  6   8  10  12
D  8  10  12  14

In [50]:
d**2

    A   B   C   D
A   1   4   9  16
B   4   9  16  25
C   9  16  25  36
D  16  25  36  49

In [51]:
d['E']=['5','6','7','8']

In [52]:
print(d)

   A  B  C  D  E
A  1  2  3  4  5
B  2  3  4  5  6
C  3  4  5  6  7
D  4  5  6  7  8

In [53]:
d.insert(1,'F',['6','6','6','6'])

In [56]:
print(d)

   A  F  B  C  D  E
A  1  6  2  3  4  5
B  2  6  3  4  5  6
C  3  6  4  5  6  7
D  4  6  5  6  7  8

In [57]:
e=d.join(c)

In [60]:
print(e)

   A  F  B  C  D  E name gender
A  1  6  2  3  4  5  NaN    NaN
B  2  6  3  4  5  6  NaN    NaN
C  3  6  4  5  6  7  NaN    NaN
D  4  6  5  6  7  8  NaN    NaN

In [64]:
print(c)

     name gender
0  Jony J      男
1  Eminem      男
2   KeyNG      男

In [67]:
f=pd.DataFrame(['hello','world','my','name'],index=list('ABDH'),columns=list('G'))

In [69]:
g=d.join(f)

In [71]:
print(g)

   A  F  B  C  D  E      G
A  1  6  2  3  4  5  hello
B  2  6  3  4  5  6  world
C  3  6  4  5  6  7    NaN
D  4  6  5  6  7  8     my

In [73]:
h=d.join(f,how='inner')

In [74]:
print(h)

   A  F  B  C  D  E      G
A  1  6  2  3  4  5  hello
B  2  6  3  4  5  6  world
D  4  6  5  6  7  8     my